USE s09p22c105;

INSERT INTO users (login_id, password, nickname)
VALUES ('cat', '{bcrypt}$2a$10$Mkztm/Vd4H54WdXIcRHz/OKD7X8DXK.hgf7viiqq9feeI8ENbp7pu', '고양이'),
       ('dog', '{bcrypt}$2a$10$Mkztm/Vd4H54WdXIcRHz/OKD7X8DXK.hgf7viiqq9feeI8ENbp7pu', '강아지');

INSERT INTO quotation (user_id, cpu_id, gpu_id, ram_id, hdd_id, ssd_id, power_id, mainboard_id, cooler_id, case_id, name)
VALUES ('1', '1', '1', '1', '1', '1', '1', '1', '1', '1', 'cat 견적 1'),
       ('1', '10', '10', '10', '10', '10', '10', '10', '10', '10', 'cat 견적 2'),
       ('1', '20', '20', '20', '20', '20', '20', '20', '20', '20', 'cat 견적 3'),
       ('1', '30', '30', '30', '30', '30', '30', '30', '30', '30', 'cat 견적 4'),
       ('1', '40', '40', '40', '40', '40', '40', '40', '40', '40', 'cat 견적 5'),
       ('2', '50', '50', '50', '50', '50', '50', '50', '50', '50', 'dog 견적 1'),
       ('2', '60', '60', '60', '60', '60', '60', '60', '60', '60', 'dog 견적 2'),
       ('2', '70', '70', '70', '70', '70', '70', '70', '70', '70', 'dog 견적 3'),
       ('2', '80', '80', '80', '80', '80', '80', '80', '80', '80', 'dog 견적 4'),
       ('2', '90', '90', '90', '90', '90', '90', '90', '90', '90', 'dog 견적 5');
